In [1]:
import pandas as pd
import numpy as np

In [5]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [8]:

r=pd.DataFrame(raw_data)
r

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [9]:
gby_reg = r['preTestScore'].groupby(r['regiment'])
gby_reg

In [10]:
gby_reg.mean()

regiment
Dragoons      15.50
Nighthawks    15.25
Scouts         2.50
Name: preTestScore, dtype: float64

In [18]:
# Present general statistics by company
r['preTestScore' ].groupby(r['company']).describe()

         count       mean        std  min   25%   50%    75%   max
company
1st        6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd        6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

In [21]:
# What is the mean of each company's preTestScore
r['preTestScore'].groupby([r['company']]).mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

In [11]:
## Present the mean preTestScores grouped by regiment and company
r['preTestScore'].groupby([r['regiment'], r['company']]).mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

In [12]:
# Present the mean postTestScores grouped by regiment and company
r['postTestScore'].groupby([r['regiment'], r['company']]).mean()

regiment    company
Dragoons    1st        47.5
            2nd        75.5
Nighthawks  1st        59.5
            2nd        59.5
Scouts      1st        66.0
            2nd        66.0
Name: postTestScore, dtype: float64

In [14]:
# Group the entire dataframe by regiment and company
r.groupby(['regiment', 'company']).mean()

                    preTestScore  postTestScore
regiment   company
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

In [15]:
# no of observation
r.groupby(['regiment', 'company']).size()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

In [22]:

a=5

In [38]:
a="XYYZXYXXY"
b="XYXZZY"
a=b
l=len(a)
total=l/3
print(total)
x=a.count('X')
y=a.count('Y')
z=a.count('Z')
if(total==x==y==z):
  print("yes")
else:

2.0
yes